
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.Реализация.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Реализация.Дата,
	|	Реализация.Контрагент,
	|	Реализация.Номер,
	|	Реализация.СписокТоваров.(
	|		НомерСтроки,
	|		Товар,
	|		Количество,
	|		Цена,
	|		Сумма
	|	)
	|ИЗ
	|	Документ.Реализация КАК Реализация
	|ГДЕ
	|	Реализация.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСписокТоваровШапка = Макет.ПолучитьОбласть("СписокТоваровШапка");
	ОбластьСписокТоваров = Макет.ПолучитьОбласть("СписокТоваров");
	ОбластьИтого = Макет.ПолучитьОбласть("Итого");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ОбластьЗаголовок.Параметры.Номер = Выборка.Номер;
		ОбластьЗаголовок.Параметры.Дата  = Формат(Выборка.Дата, "ДФ=dd.MM.yyyy");
		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());     	
		
		ТабДок.Вывести(ОбластьСписокТоваровШапка); 
		
		ИтоговаяСумма = 0;

		ВыборкаСписокТоваров = Выборка.СписокТоваров.Выбрать();
		Пока ВыборкаСписокТоваров.Следующий() Цикл
			ОбластьСписокТоваров.Параметры.Заполнить(ВыборкаСписокТоваров);
			ТабДок.Вывести(ОбластьСписокТоваров, ВыборкаСписокТоваров.Уровень());
			ИтоговаяСумма = ИтоговаяСумма + ВыборкаСписокТоваров.Сумма;
		КонецЦикла; 
				
		ОбластьИтого.Параметры.СуммаИтого = ИтоговаяСумма;
		
		ТабДок.Вывести(ОбластьИтого);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
