#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ОстатокТоваров Расход
	Движения.ОстатокТоваров.Очистить();
	Движения.ОстатокТоваров.Записывать = Истина;
	Для Каждого СтрокаТоваров Из СписокТоваров Цикл
		ДвижениеРегистра = Движения.ОстатокТоваров.Добавить();
		ДвижениеРегистра.ВидДвижения = ВидДвиженияНакопления.Расход;
		ДвижениеРегистра.Период = Дата;
		ДвижениеРегистра.Товар = СтрокаТоваров.Товар;
		ДвижениеРегистра.Количество = СтрокаТоваров.Количество;
	КонецЦикла;
	
КонецПроцедуры
#КонецОбласти