#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ОстатокТоваров Расход 
	Движения.ОстатокТоваров.Очистить();
	Движения.ОстатокТоваров.Записывать = Истина;
	
	Для Каждого СтрокаТоваров Из СписокТоваров Цикл  
		ДвижениеОстатка = Движения.ОстатокТоваров.Добавить();		
		ДвижениеОстатка.ВидДвижения = ВидДвиженияНакопления.Расход;
		ДвижениеОстатка.Период = Дата;
		ДвижениеОстатка.Товар = СтрокаТоваров.Товар;
		ДвижениеОстатка.Количество = СтрокаТоваров.Количество;
	КонецЦикла;
	
КонецПроцедуры
#КонецОбласти    

#Область Процедуры
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЭтотОбъект.СписокТоваров.Количество() = 0 Тогда
		Отказ = Истина;
		Сообщить("Невозможно провести документ с пустой табличной частью!");
	КонецЕсли;
	
	
КонецПроцедуры  
#КонецОбласти