#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ОстатокТоваров Приход  
	Движения.ОстатокТоваров.Очистить();
	Движения.ОстатокТоваров.Записывать = Истина; 
	
	Для Каждого СтрокаТоваров Из СписокТоваров Цикл 
		ДвижениеОстатка = Движения.ОстатокТоваров.Добавить();
		ДвижениеОстатка.ВидДвижения = ВидДвиженияНакопления.Приход;
		ДвижениеОстатка.Период = Дата;
		ДвижениеОстатка.Товар = СтрокаТоваров.Товар;
		ДвижениеОстатка.Количество = СтрокаТоваров.Количество;
	КонецЦикла;
	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
#КонецОбласти

#Область Процедуры
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЭтотОбъект.СписокТоваров.Количество() = 0 Тогда
		Отказ = Истина;
		Сообщить("Невозможно провести документ с пустой табличной частью!");
	КонецЕсли;
	
КонецПроцедуры  
#КонецОбласти