#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ОстатокТоваров Приход
	Движения.ОстатокТоваров.Очистить();
	Движения.ОстатокТоваров.Записывать = Истина;
	Для Каждого СтрокаТоваров Из СписокТоваров Цикл
		ДвижениеРегистра = Движения.ОстатокТоваров.Добавить();
		ДвижениеРегистра.ВидДвижения = ВидДвиженияНакопления.Приход;
		ДвижениеРегистра.Период = Дата;
		ДвижениеРегистра.Товар = СтрокаТоваров.Товар;
		ДвижениеРегистра.Количество = СтрокаТоваров.Количество;
	КонецЦикла;
	            
КонецПроцедуры
#КонецОбласти